#+TITLE: 8004 Homework 4
#+AUTHOR: Nooreen Dabbish
#+EMAIL: nerd@temple.edu
#+LATEX_HEADER: \usepackage{methodshw}
#+LATEX_HEADER: \usepackage{booktabs}
#+OPTIONS: toc:nil

# Code to input variables, libraries, and commonly used functions:
#+NAME: common
#+BEGIN_SRC R :session *HW4* :exports none :tangle yes
   library(MASS); library(xtable)
     lvector <- function(x, dig = 2, dsply=rep("f",ncol(x)+1)) {
      x <- xtable(x, align=rep("",ncol(x)+1),display=dsply,digits=dig) # We repeat empty string 6 times
      print(x, floating=FALSE, tabular.environment="pmatrix", 
        hline.after=NULL, include.rownames=FALSE, include.colnames=FALSE)
      }
   
   #Variables from Problem 2 of HW3:
     Y1 <- matrix(c(2, 1, 4, 6, 3, 5), nrow=6, ncol=1)
     X1 <- matrix(c(rep(1,6),
                   1,1,0,0,0,0,
                   0,0,1,0,0,0,
                   0,0,0,1,0,0,
                   0,0,0,0,1,1),nrow = 6,byrow=FALSE)
   
   #Variables from Problem 4 of HW3:
   data(Boston)
   YB = as.matrix(Boston$medv)
   XB = as.matrix(Boston[,c('crim','nox','rm','age','dis')])
   XB = cbind(rep(1,dim(Boston)[1]),XB)
   bhatB <- ginv(t(XB)%*%XB) %*% t(XB) %*% YB
   YhatB <- XB %*% bhatB
   errB <- YB - YhatB
   sigsqhatB <- t(errB) %*% errB / (dim(XB)[1] - qr(XB)$rank)
   
   #functions for calculating estimates:
   
   sigmacalc <- function(Y, X, alpha){
   Yh <- X %*% ginv(t(X) %*% X) %*% t(X) %*% Y
   SSE <- t(Y-Yh) %*% (Y-Yh)
   
   lowerchi <- qchisq(alpha/2, df=(length(Y) - qr(X)$rank))
   upperchi <- qchisq(1-alpha/2, df=(length(Y) - qr(X)$rank))
   
   return(c(sqrt(SSE/upperchi),sqrt(SSE/lowerchi)))
   }
   
  X511 <- matrix(c(rep(1,9),rep(c(rep(0,7),1),3),1,1),7,5)
  Y511 <- c(2,1,4,6,3,5,4)
     
   cbetacalc <- function(Y,X, alpha, ct){
   Yh <- X %*% ginv(t(X) %*% X) %*% t(X) %*% Y
   SSE <- t(Y-Yh) %*% (Y-Yh)
   MSE <- SSE/(length(Y) - qr(X)$rank)
   quad <- t(ct)%*%ginv(t(X)%*%X)%*%ct
   
   tstar <- qt(1-alpha/2, length(Y) - qr(X)$rank)
   pm <- tstar  * sqrt(quad) * sqrt (MSE)
   
   ctbhat <- t(ct)%*%ginv(t(X)%*%X)%*%t(X)%*%Y
   
   return(c(ctbhat-pm,ctbhat+pm))
   }
   
   a_1c = matrix(c(0,1,-1,0,0))
   
   cbetacalc(Y511,X511, .1, c(1,1,0,0,0))
   cbetacalc(Y1,X1, .1, c(1,0,1,0,0))
   cbetacalc(Y1,X1, .1, a_1c)
   
  #F-test function:
  
   Cbetahatd <- function (Y,X, ct, d = 0){
   
   CGCinv <- ginv(t(ct)%*%ginv(t(X)%*%(X))%*%ct)
   CBhat <- t(ct)%*%ginv(t(X)%*%X)%*%t(X)%*%Y
   Q <- t(CBhat - d)%*%CGCinv%*%(CBhat-d)
   MSH <- Q/qr(ct)$rank
  
   Yhat <- X %*% ginv(t(X)%*%X)%*%t(X)%*%Y
   SSE <- t(Y-Yhat)%*%(Y-Yhat)
   MSE <- SSE/(length(Y) - qr(X)$rank)
  
   F <- MSH/MSE
  
   return(1-pf(F, qr(ct)$rank, length(Y)-qr(X)$rank))
   
   }
  
  
   Cbetahatd(Y1, X1, c(0,1,-1,0,0))
  
  G <- t(matrix(c(0, 1, -1, 0, 0, 0, 1, 0, -1, 0, 0, 1, 0, 0, -1), nrow=3, ncol=5, byrow=TRUE))
  
   Cbetahatd(Y511, X511, G, c(0,0,0))
  
  H <- t(matrix(c(0, 1, -1, 0, 0, 0, 0, 1, -1, 0), nrow=2, ncol=5, byrow=T))
  
   Cbetahatd(Y1, X1, H, c(10,0))
  
  
   homes<- read.table("http://www.public.iastate.edu/~vardeman/stat511/homes.TXT",header=T) 
   Yhomes <-as.matrix(homes[,1])
   Xhomes <-as.matrix(homes[,c(2,5,10,11,13)]) 
   Xhomes <- cbind(rep(1,length(Yhomes)),Xhomes)
  
   C2g <- c(0,0,1,0,1,0)
   Cbetahatd(Yhomes, Xhomes,C2g)
  
#+END_SRC

#+RESULTS: common
: 4.56960612884975


** Find 90% two-sided confidence limits for \sigma.

The model described in HW3, Problem 2 in 
$\mathbf{Y}=\mathbf{X\beta}+\epsilon$ matrix form is:

\[
\begin{pmatrix}
y_{11} \\ y_{12}\\ y_{21}\\ y_{31}\\ y_{41}\\ y_{42}
\end{pmatrix} = 
\begin{pmatrix} 
2\\ 1\\ 4\\ 6\\ 3\\ 5
\end{pmatrix} = 
\begin{pmatrix}
1 & 1 & 0 & 0 & 0 \\
1 & 1 & 0 & 0 & 0 \\
1 & 0 & 1 & 0 & 0 \\
1 & 0 & 0 & 1 & 0 \\
1 & 0 & 0 & 0 & 1 \\
1 & 0 & 0 & 0 & 1 \\
\end{pmatrix}  
\begin{pmatrix}
\mu \\ \tau_1 \\ \tau_2 \\ \tau_3 \\ \tau_4 
\end{pmatrix} + 
\begin{pmatrix}
\epsilon_{11} \\ \epsilon_{12}\\ \epsilon_{21}\\ \epsilon_{31}\\ \epsilon_{41}\\ \epsilon_{42}
\end{pmatrix}
\]

Because the problem statement says this is a Gauss-Markov normal
linear model, we know that *Y* \sim N(*X\beta*,\sigma^2 *I*).

#+BEGIN_SRC R :session *HW4* :exports code :tangle yes
  Yhat <- X %*% ginv(t(X) %*% X) %*% t(X) %*% Y
  
  SSE1a3 <- t(Y-Yhat) %*% (Y-Yhat)
  
  lowerchi <- qchisq(.05, df=(length(Y) - qr(X)$rank))
  upperchi <- qchisq(.95, df=(length(Y) - qr(X)$rank))
  
#+END_SRC

#+RESULTS:
: 5.99146454710798

For the Gauss-Markov linear model of HW3 Problem 2, we found an SSE of SRC_R[ :session *HW4*]{round(SSE1a3,4)} and two-sided 90% confidence
limits for \sigma of SRC_R[ :session *HW4*]{round(sqrt(SSE1a3/upperchi),4)} <
\sigma < SRC_R[ :session *HW4*]{round(sqrt(SSE1a3/lowerchi),4)}.

